[
    {
        "title": "How to Complete a Performance Review Self-Evaluation",
        "image": "https://www.reviewsnap.com/wp-content/uploads/2020/02/reviewsnap-notes-1024x747.jpg",
        "description": "We now want to help those employees by providing advice on how they can best complete their self-evaluation. Being asked to review yourself can be intimidating",
        "details": "https://www.reviewsnap.com/blog/complete-performance-review-self-evaluation/"
    },
    {
        "title": "5 Employee Engagement Trends In The Post COVID Era",
        "image": "https://i.ibb.co/PYnJsfj/images.jpg",
        "description": "The term “employee engagement,” isn’t a new one. But since its original concept in 1990 and now, the way we view engagement in the workplace has shifted dramatically.",
        "details": "https://www.15five.com/blog/employee-engagement-trends-in-the-era-of-coronavirus/"
    },
    {
        "title": "Returning To Work After Vacation [8 Tips and  Examples]",
        "image": "https://cdn.pixabay.com/photo/2015/05/31/10/52/technology-791034__340.jpg",
        "description": "Whether you’re dreaming of relaxing among palm trees, the peace of a quiet cabin in the woods, or soaking up the history of an old European city, the weeks leading up to a vacation can be full of excitement",
        "details": "https://www.bamboohr.com/blog/returning-to-work-after-vacation"
    },
    {
        "title": "Building a Business Case for Leadership & Manager Coaching ",
        "image": "https://i.ibb.co/stDGZDd/images.jpg",
        "description": "With the rapid technological and cultural changes our society has experienced over the last few decades, the old leadership styles leftover from the industrial age are no longer effective.",
        "details": "https://www.15five.com/blog/the-roi-of-coaching/"
    },
    {
        "title": "Should Compensation Be Tied to Performance Reviews?",
        "image": "https://i.ibb.co/5k5FHy2/download.jpg",
        "description": "Performance and compensation management can be scary. Sitting down with your manager to go over your performance for the last year and getting feedback is nerve-wracking but essential for employees who want to grow in their careers.",
        "details": "https://www.15five.com/blog/should-compensation-be-tied-to-performance-reviews/"
    },
    {
        "title": "How Remote Work Is Impacting Fair Labor Laws",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRyUxosohS2tZJ9Xk3sWFex_RFJ03vdeFWQHQ&usqp=CAU",
        "description": "By now, you’ve heard of the massive workplace transition many are calling the Great Resignation or the Big Quit. This “professional pandemic” is affecting millions of employees and employers across the country.",
        "details": "https://www.bamboohr.com/blog/how-remote-work-is-impacting-fair-labor-laws"
    },
    {
        "title": "5 Key Metrics To Grade Your Hiring Process",
        "image": "https://i.ibb.co/F6gZrvH/images.png",
        "description": "People analytics and HR analytics are essential, though often overlooked and misunderstood, tools for HR leaders. These analytics are used to measure, collect, and analyze all of the hiring process data to help streamline efforts, make better decisions",
        "details": "https://www.trakstar.com/blog-post/5-key-metrics-to-grade-your-hiring-process/"
    },
    {
        "title": "HR in Healthcare: Top Challenges (and How To Overcome Them)",
        "image": "https://i.ibb.co/RQjDfHR/download.jpg",
        "description": "Working for HR in healthcare feels exceptionally different than it does in other industries. Why? Healthcare workers have always faced pushback, overwork, and public pressures – all of those struggles are felt by the HR department. ",
        "details": "https://www.trakstar.com/blog-post/hr-healthcare-top-challenges-overcome/"
    },
    {
        "title": "How to Reduce Zoom Fatigue in Your Employees",
        "image": "https://i.ibb.co/cDpQxsY/download.jpg",
        "description": "Zoom fatigue is real! You might think leading employees who work from home means they are less stressed, easier to handle, and happier than ever. Unfortunately, that isn’t always the case. Zoom fatigue syndrome is something many HR leaders are fighting in employees ",
        "details": "https://www.trakstar.com/blog-post/reduce-zoom-fatigue-employees/"
    },
    {
        "title": "6 Employee engagement models for a thriving workplace",
        "image": "https://i.ibb.co/xsFq8K2/download.jpg",
        "description": "The aim of employee engagement isn’t just to stay in business or maximize profitability. It’s also about ensuring your employees are satisfied and fulfilled.And yet, it can feel daunting to design an entire employee engagement structure from scratch.",
        "details": "https://www.leapsome.com/blog/employee-engagement-models"
    },
    {
        "title": "Boosting Performance with Organizational Transparency",
        "image": "https://i.ibb.co/s2ybKBy/images.jpg",
        "description": "Communication is one of the biggest challenges that we see at companies today. Whether it’s leadership sharing major updates, managers having candid discussions on promotions, or colleagues sharing peer feedback",
        "details": "https://www.reflektive.com/blog/boosting-performance-organizational-transparency/"
    },
    {
        "title": "8 Ways an ATS Can Help Streamline the Hiring Process",
        "image": "https://i.ibb.co/3k3LTfb/images.jpg",
        "description": "The hiring process is a critical part of the employee experience. It sets the tone for what working at your company would be like and gives job seekers a feel for how they’d be treated as employees.",
        "details": "https://blog.clearcompany.com/ways-an-ats-can-help-streamline-the-hiring-process"
    },
    {
        "title": "How to Complete a Performance Review Self-Evaluation",
        "image": "https://i.ibb.co/XsSHyWk/images.jpg",
        "description": "We now want to help those employees by providing advice on how they can best complete their self-evaluation. Being asked to review yourself can be intimidating. On one hand, you want to make sure your evaluation.",
        "details": "https://www.reviewsnap.com/blog/complete-performance-review-self-evaluation/"
    }
]